<a href="https://colab.research.google.com/github/FGalvao77/others-knowledge-in-python-for-data-science/blob/main/Uso_do_group_by.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# importando as biblioteca
import pandas as pd
import numpy as np

In [2]:
# criando um dicionário de lista
data = {
    'Sede': ['SP', 'SP', 'MG', 'MG', 'RJ', 'RJ', 
             'ES', 'ES'],
    'Vendedor': ['Jorge', 'Ana', 'Tiago', 'Pedro', 
                 'Raphaela', 'Gustavo', 'Maria', 
                 'Carolina'],
    'Vendas': [2000, 2500, 3100, 1200, 1500, 
               3900, 2900, 3900]
}

In [3]:
# através do dicionário de lista criando um dataframe
df = pd.DataFrame(data)
df

  Sede  Vendedor  Vendas
0   SP     Jorge    2000
1   SP       Ana    2500
2   MG     Tiago    3100
3   MG     Pedro    1200
4   RJ  Raphaela    1500
5   RJ   Gustavo    3900
6   ES     Maria    2900
7   ES  Carolina    3900

In [4]:
# agrupando por região
df.groupby('Sede')

In [5]:
# visualizar o agrupamento
by_sede = df.groupby('Sede')

In [6]:
# visualizando os vendedores com maior venda
by_sede.max()

      Vendedor  Vendas
Sede
ES       Maria    3900
MG       Tiago    3100
RJ    Raphaela    3900
SP       Jorge    2500

In [7]:
# visualizando a média de vendas por sede
by_sede.mean()

      Vendas
Sede
ES      3400
MG      2150
RJ      2700
SP      2250

In [8]:
# dados estatísticos
by_sede.describe()

     Vendas
      count    mean          std     min     25%     50%     75%     max
Sede
ES      2.0  3400.0   707.106781  2900.0  3150.0  3400.0  3650.0  3900.0
MG      2.0  2150.0  1343.502884  1200.0  1675.0  2150.0  2625.0  3100.0
RJ      2.0  2700.0  1697.056275  1500.0  2100.0  2700.0  3300.0  3900.0
SP      2.0  2250.0   353.553391  2000.0  2125.0  2250.0  2375.0  2500.0

In [9]:
# dados estatísticos
by_sede.describe().transpose()

Sede                   ES           MG           RJ           SP
Vendas count     2.000000     2.000000     2.000000     2.000000
       mean   3400.000000  2150.000000  2700.000000  2250.000000
       std     707.106781  1343.502884  1697.056275   353.553391
       min    2900.000000  1200.000000  1500.000000  2000.000000
       25%    3150.000000  1675.000000  2100.000000  2125.000000
       50%    3400.000000  2150.000000  2700.000000  2250.000000
       75%    3650.000000  2625.000000  3300.000000  2375.000000
       max    3900.000000  3100.000000  3900.000000  2500.000000

In [10]:
# dados estatísticos
by_sede.describe().T

Sede                   ES           MG           RJ           SP
Vendas count     2.000000     2.000000     2.000000     2.000000
       mean   3400.000000  2150.000000  2700.000000  2250.000000
       std     707.106781  1343.502884  1697.056275   353.553391
       min    2900.000000  1200.000000  1500.000000  2000.000000
       25%    3150.000000  1675.000000  2100.000000  2125.000000
       50%    3400.000000  2150.000000  2700.000000  2250.000000
       75%    3650.000000  2625.000000  3300.000000  2375.000000
       max    3900.000000  3100.000000  3900.000000  2500.000000

In [11]:
# dados estatísticos por  uma coluna específica
by_sede.describe().transpose()['SP']

Vendas  count       2.000000
        mean     2250.000000
        std       353.553391
        min      2000.000000
        25%      2125.000000
        50%      2250.000000
        75%      2375.000000
        max      2500.000000
Name: SP, dtype: float64

In [12]:
# dados estatísticos por  uma coluna específica
by_sede.describe().T['SP']

Vendas  count       2.000000
        mean     2250.000000
        std       353.553391
        min      2000.000000
        25%      2125.000000
        50%      2250.000000
        75%      2375.000000
        max      2500.000000
Name: SP, dtype: float64

In [13]:
# instanciando novos dados para criar um dataframe multi-indexes
arrays = [['São Paulo', 'São Paulo', 
           'Rio de Janeiro', 'Rio de Janeiro', 
           'Minas Gerais', 'Minas Gerais'], 
          ['Garrafas', 'Copos', 'Garrafas', 'Copos', 
           'Garrafas', 'Copos']]

indexes = pd.MultiIndex.from_arrays(arrays, names=('Estado', 'Produto'))

df = pd.DataFrame({'Total vendido R$': [10000, 35000, 22400, 12890, 13900, 23751]}, index=indexes)

df

                         Total vendido R$
Estado         Produto
São Paulo      Garrafas             10000
               Copos                35000
Rio de Janeiro Garrafas             22400
               Copos                12890
Minas Gerais   Garrafas             13900
               Copos                23751

In [14]:
arrays = [['São Paulo', 'São Paulo', 
           'Rio de Janeiro', 'Rio de Janeiro', 
           'Minas Gerais', 'Minas Gerais'], 
          ['Garrafas', 'Copos', 'Garrafas', 'Copos', 
           'Garrafas', 'Copos']]

In [15]:
indexes = pd.MultiIndex.from_arrays(arrays, names=('Estado', 'Produto'))

In [16]:
df1 = pd.DataFrame({'Total vendido R$': [10000, 35000, 22400, 12890, 13900, 23751]}, index=indexes)

In [17]:
df1

                         Total vendido R$
Estado         Produto
São Paulo      Garrafas             10000
               Copos                35000
Rio de Janeiro Garrafas             22400
               Copos                12890
Minas Gerais   Garrafas             13900
               Copos                23751

In [18]:
# realizando agrupamento por "estado"
by_estado = df1.groupby('Estado', level=0)
by_estado.describe().T

Estado                  Minas Gerais  Rio de Janeiro    São Paulo
Total vendido R$ count      2.000000        2.000000      2.00000
                 mean   18825.500000    17645.000000  22500.00000
                 std     6965.708901     6724.585489  17677.66953
                 min    13900.000000    12890.000000  10000.00000
                 25%    16362.750000    15267.500000  16250.00000
                 50%    18825.500000    17645.000000  22500.00000
                 75%    21288.250000    20022.500000  28750.00000
                 max    23751.000000    22400.000000  35000.00000

In [19]:
by_estado.mean()

                Total vendido R$
Estado
Minas Gerais             18825.5
Rio de Janeiro           17645.0
São Paulo                22500.0

In [20]:
by_produto = df1.groupby('Produto', level=1)

In [21]:
by_produto.mean()

          Total vendido R$
Produto
Copos         23880.333333
Garrafas      15433.333333